Конфигурация/Documents/РегистрацияФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияФинансовыхПоказателей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФинансовыеПоказатели</xr:Item>
				<xr:Item>InformationRegister.ПоказателиДеятельности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФинансовыеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПоказателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/РегистрацияСтоимостиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияСтоимостиАктивов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФинансовыеПоказатели</xr:Item>
				<xr:Item>InformationRegister.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельРасчетаСтоимостиОценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СЧАРынок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СЧАБаланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияСтоимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСтоимостиПереоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеРезервовПИФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеСписаниеРезервов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АктивыНеОтносящиесяКЦеннымБумагам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СубъектАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБаланс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРынок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтроки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСтоимостиАктивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
								<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРынокВВалютеУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньОценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РегистрацияФинансовыхПоказателей/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, , , Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СубъектАналитикиПриИзменении(Элемент)
	Объект.ФинансовыеПоказатели.Очистить();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаЗаполнитьФинансовыеПоказателиСтандартнойСтратегии(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СубъектАналитики) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Стратегия"" не заполнено",, "Объект.СубъектАналитики");
		Возврат;
	КонецЕсли;
	
	Если МожноОчиститьФинансовыеПоказатели() Тогда
		Для каждого Элемент Из РассчитатьФинансовыеПоказателиСтандартнойСтратегии(Объект.Организация, Объект.СубъектАналитики, Объект.Дата) Цикл
			НоваяСтрокаФинансовыеПоказатели = Объект.ФинансовыеПоказатели.Добавить();
			НоваяСтрокаФинансовыеПоказатели.ВидПоказателя = Элемент.Ключ;
			НоваяСтрокаФинансовыеПоказатели.Значение      = Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьПоказателиСтратегииДляСайтаДУИИС(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр         = "XML|*.xml";
	Диалог.ПолноеИмяФайла = СтрЗаменить(Строка(Объект.СубъектАналитики), " ", "_") + "_" + Формат(Объект.Дата, "ДФ=yyyy_MM") + ".xml";

	Если Не Диалог.Выбрать() Тогда
	    Возврат;
	КонецЕсли;

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(Диалог.ПолноеИмяФайла, "UTF-8");
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДоходностьПоСтратегии");
	ЗаписьXML.ЗаписатьАтрибут("Стратегия", Строка(Объект.СубъектАналитики));
	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования", "" + ТекущаяДата());
	ЗаписьXML.ЗаписатьАтрибут("Версия", "0.01");
	
	ЗарегистированныеФинансовыеПоказатели = ПолучитьЗарегистированныеФинансовыеПоказателиПоСтратегии(Объект.Дата, Объект.Организация, Объект.СубъектАналитики);
	
	Для каждого НаборПоказателей Из ЗарегистированныеФинансовыеПоказатели Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПоказателиЗаПериод");
				
		Для каждого ЭлементПоказатель Из НаборПоказателей Цикл
			ЗаписьXML.ЗаписатьАтрибут(ЭлементПоказатель.Ключ, ЭлементПоказатель.Значение);
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПоказателиЗаПериод
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ДоходностьПоСтратегии
	ЗаписьXML.Закрыть();
	
	Сообщить("Файл " + Диалог.ПолноеИмяФайла + " успешно сохранен.");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьРасчет(Команда)
	
	ТекСтрока = Элементы.ФинансовыеПоказатели.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли ПолучитьПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт().Найти(ТекСтрока.ВидПоказателя) <> Неопределено Тогда
	
		ДеталиРасчета = КомандаОтобразитьРасчетНаСервере(Объект.Организация, Объект.СубъектАналитики, Объект.Дата);
		ДеталиРасчета.Показать("Расчет финансовых показателей стандартной стратегии " + Объект.СубъектАналитики + " на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));
		
	ИначеЕсли ТекСтрока.ВидПоказателя = ПредопределенноеЗначение("Справочник.ВидыФинансовыхПоказателей.КатегорияПрофессиональногоУчастникаРынкаЦенныхБумаг") Тогда
		
		ДеталиРасчета = ОтобразитьРасчетКатегорииПрофессиональногоУчастникаРынкаЦенныхБумагНаСервере(Объект.Организация, Объект.Дата);
		
		Если ДеталиРасчета <> Неопределено Тогда
			ДеталиРасчета.Показать("Расчет показателей деятельности и квартальные диапазоны  их значений");
		КонецЕсли;
		
	ИначеЕсли ТекСтрока.ВидПоказателя = ПредопределенноеЗначение("Справочник.ВидыФинансовыхПоказателей.ДоходностьСтратегииСНачалаГода") Тогда
		ДеталиРасчета = ОтобразитьРасчетДоходностиСтратегииСНачалаГода(Объект.Организация, Объект.СубъектАналитики, Объект.Дата);
		
		Если ДеталиРасчета <> Неопределено Тогда
			ДеталиРасчета.Показать("Расчет доходности стратегии с начала года");
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ТекСТрока.ВидПоказателя) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для финансового показателя " + ТекСтрока.ВидПоказателя + " отображение расчета не поддерживается");
		
	Иначе 
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран финансовый показатель");
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьКвартальныеПоказателиДеятельности(Команда)
	
	Если КонецДня(Объект.Дата) <> КонецКвартала(Объект.Дата) Тогда
		Предупреждение("Квартальные показатели деятельности заполняются только на конец квартала");
		Возврат;
	КонецЕсли;
	
	Если МожноОчиститьФинансовыеПоказатели() Тогда
		Для каждого Элемент Из РассчитатьКвартальныеПоказателиДеятельности(Объект.Организация, Объект.Дата) Цикл
			НоваяСтрокаФинансовыеПоказатели = Объект.ФинансовыеПоказатели.Добавить();
			НоваяСтрокаФинансовыеПоказатели.ВидПоказателя = Элемент.Ключ;
			НоваяСтрокаФинансовыеПоказатели.Значение      = Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьКатегориюПрофессиональногоУчастникаРынкаЦенныхБумаг(Команда)
	
	Если НачалоДня(Объект.Дата) <> НачалоГода(Объект.Дата) Тогда
		Предупреждение("Категория профессионального участника рынка ценных бумаг заполняется только на 1 января");
		Возврат;
	КонецЕсли;

	Если МожноОчиститьФинансовыеПоказатели() Тогда
		Для каждого Элемент Из РассчитатьКатегориюПрофессиональногоУчастникаРынкаЦенныхБумаг(Объект.Организация, Объект.Дата) Цикл
			НоваяСтрокаФинансовыеПоказатели = Объект.ФинансовыеПоказатели.Добавить();
			НоваяСтрокаФинансовыеПоказатели.ВидПоказателя = Элемент.Ключ;
			НоваяСтрокаФинансовыеПоказатели.Значение      = Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция МожноОчиститьФинансовыеПоказатели()
	
	Если Объект.ФинансовыеПоказатели.Количество() > 0 Тогда
		РезультатВопроса = Вопрос("Текущие финансовые показатели будут безвозвратно утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Объект.ФинансовыеПоказатели.Очистить();
			ЭтаФорма.Модифицированность = Истина;
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ЭтаФорма.Модифицированность = Истина;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ЭтаФорма.ГруппаПоказателей = ПолучитьГруппуПоказателей(Объект.СубъектАналитики);
	ЗаполнитьГруппыВидовФинансовыхПоказателей(ГруппыВидовФинансовыхПоказателей, ЭтаФорма.ГруппаПоказателей = "Организации");
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)

	ДанныеОбъекта = Форма.Объект;
	Элементы	  = Форма.Элементы;
	
	Элементы.СубъектАналитики.Видимость = НЕ (Форма.ГруппаПоказателей = "Организации");
	
	Элементы.ФинансовыеПоказателиКомандаЗаполнитьФинансовыеПоказателиСтандартнойСтратегии.Видимость 				= (Форма.ГруппаПоказателей = "СтратегииИндивидуальногоИнвестирования");
	Элементы.ФинансовыеПоказателиКомандаВыгрузитьПоказателиСтратегииДляСайтаДУИИС.Видимость 						= (Форма.ГруппаПоказателей = "СтратегииИндивидуальногоИнвестирования");
	Элементы.ФинансовыеПоказателиКомандаЗаполнитьКвартальныеПоказателиДеятельности.Видимость						= (Форма.ГруппаПоказателей = "Организации");
	Элементы.ФинансовыеПоказателиКомандаЗаполнитьКатегориюПрофессиональногоУчастникаРынкаЦенныхБумаг.Видимость		= (Форма.ГруппаПоказателей = "Организации");
	
	Если Форма.ГруппаПоказателей <> "Организации" И ЗначениеЗаполнено(Форма.ГруппаПоказателей) Тогда
		Элементы.СубъектАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + Форма.ГруппаПоказателей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьГруппуПоказателей(СубъектАналитики)

	Если ЗначениеЗаполнено(СубъектАналитики) И ТипЗнч(СубъектАналитики) = Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования") Тогда
		Возврат "СтратегииИндивидуальногоИнвестирования";
	Иначе
		Возврат "Организации";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьГруппыВидовФинансовыхПоказателей(ГруппыВидовФинансовыхПоказателей, ПоказателиОрганизации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыФинансовыхПоказателей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыФинансовыхПоказателей КАК ВидыФинансовыхПоказателей
		|ГДЕ
		|	ВидыФинансовыхПоказателей.ЭтоГруппа
		|	И &ПоказателиОрганизации = (ВидыФинансовыхПоказателей.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.ПоказателиДеятельностиОрганизации))";
	
	Запрос.УстановитьПараметр("ПоказателиОрганизации", ПоказателиОрганизации);
	
	ГруппыВидовФинансовыхПоказателей.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьФинансовыеПоказателиСтандартнойСтратегии(Организация, Стратегия, ДатаРасчета) Экспорт
	
	Возврат Документы.РегистрацияФинансовыхПоказателей.РассчитатьФинансовыеПоказателиСтандартнойСтратегии(Организация, Стратегия, ДатаРасчета);
	
КонецФункции // РассчитатьФинансовыеПоказателиСтандартнойСтратегии

&НаСервереБезКонтекста
Функция РассчитатьКвартальныеПоказателиДеятельности(Организация, ДатаРасчета)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация", Организация);
	ПараметрыРасчета.Вставить("Период",		 Новый СтандартныйПериод(НачалоКвартала(ДатаРасчета), КонецКвартала(ДатаРасчета)));

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КвартальныеПоказателиДеятельности = Новый Соответствие;
	
	ТаблицаКвартальныхПоказателей = РаботаСОтчетностьюЦБ.ОКУД0420401_ПолучитьТаблицуКвартальныхПоказателей();
	Для Каждого КвартальныйПоказатель Из ТаблицаКвартальныхПоказателей Цикл
		Если КвартальныйПоказатель.ДатаНачала <= ДатаРасчета 
		  И (КвартальныйПоказатель.ДатаОкончания = Дата(1,1,1) ИЛИ КвартальныйПоказатель.ДатаОкончания >= ДатаРасчета) Тогда 
			КвартальныеПоказателиДеятельности.Вставить(КвартальныйПоказатель.ВидПоказателя, Вычислить("РаботаСОтчетностьюЦБ."  + КвартальныйПоказатель.Функция));
		КонецЕсли;
	КонецЦикла;
	
	Возврат КвартальныеПоказателиДеятельности;
	
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьКатегориюПрофессиональногоУчастникаРынкаЦенныхБумаг(Организация, ДатаРасчета)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация", Организация);
	ПараметрыРасчета.Вставить("ДатаРасчета", ДатаРасчета);

	ГодовыеПоказателиДеятельности = Новый Соответствие;
	
	Результат = РаботаСОтчетностьюЦБ.ОКУД0420401_РассчитатьКатегориюПрофУчастникаНаОснованииКвартальныхПоказателей(ПараметрыРасчета, Ложь);
	Если Результат <> Неопределено Тогда
		ГодовыеПоказателиДеятельности.Вставить(Результат.ВидПоказателя, Результат.Значение);
	КонецЕсли;
	
	Возврат ГодовыеПоказателиДеятельности;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗарегистированныеФинансовыеПоказателиПоСтратегии(Период, Организация, Стратегия)
	
	ФинансовыеПоказателиЗаПериоды = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Период КАК Период,
		|	ФинансовыеПоказатели.ВидПоказателя.ИмяПредопределенныхДанных КАК ИмяПоказателя,
		|	ФинансовыеПоказатели.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики = &СубъектАналитики
		|	И КОНЕЦПЕРИОДА(ФинансовыеПоказатели.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(ФинансовыеПоказатели.Период, МЕСЯЦ)
		|	И ФинансовыеПоказатели.ВидПоказателя В(&ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ИмяПоказателя
		|ИТОГИ ПО
		|	Период";
		
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СубъектАналитики", Стратегия);
	Запрос.УстановитьПараметр("ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт", ПолучитьПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт());
	
	ВыборкаПериод = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериод.Следующий() Цикл
		
		ФинансовыеПоказателиЗаПериод = Новый Структура("Период", Формат(ВыборкаПериод.Период, "ДФ=dd.MM.yyyy"));
		
		Выборка = ВыборкаПериод.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ФинансовыеПоказателиЗаПериод.Вставить(СтрЗаменить(Выборка.ИмяПоказателя, "СтандартныеСтратегии_", ""), Строка(Выборка.Значение));
		КонецЦикла;
		
		ФинансовыеПоказателиЗаПериоды.Добавить(ФинансовыеПоказателиЗаПериод);
		
	КонецЦикла;
	
	Возврат ФинансовыеПоказателиЗаПериоды;
	
КонецФункции // ПолучитьЗарегистированныеФинансовыеПоказателиПоСтратегии

////////////////////////////////////////////////////////////////////////////////

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт()
	
	ВидыФинансовыхПоказателей = РаботаСМетаданнымиПовтИсп.ЗначенияПредопределенныхЭлементовСправочникаВСтруктуру("ВидыФинансовыхПоказателей");
	
	ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт = Новый Массив;
	ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт.Добавить(ВидыФинансовыхПоказателей.СтандартныеСтратегии_СтоимостьПортфеля);
	ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт.Добавить(ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доход);
	ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт.Добавить(ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доходность);
	ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт.Добавить(ВидыФинансовыхПоказателей.СтандартныеСтратегии_СреднемесячнаяДоходность);
	
	Возврат ПоказателиСтандартнойСтратегииДляВыгрузкиНаСайт;	
	
КонецФункции

&НаСервереБезКонтекста 
Функция КомандаОтобразитьРасчетНаСервере(Организация, СубъектАналитики, Дата, ДоходностьПФР=Ложь, НачалоПериода = Неопределено)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Получаем макет и области таб. документа.
	Макет					= Документы.РегистрацияФинансовыхПоказателей.ПолучитьМакет("РасшифровкаРасчетаДоходностиПоСтратегиям");
	Шапка					= Макет.ПолучитьОбласть("Шапка");
	Строка					= Макет.ПолучитьОбласть("Строка");
	ШапкаСтоимостьПортфеля	= Макет.ПолучитьОбласть("ШапкаСтоимостьПортфеля");
	СтрокаСтоимостьПортфеля	= Макет.ПолучитьОбласть("СтрокаСтоимостьПортфеля");
	
	ШапкаСреднемесячнаяДоходность	= Макет.ПолучитьОбласть("ШапкаСреднемесячнаяДоходность");
	СтрокаСреднемесячнаяДоходность	= Макет.ПолучитьОбласть("СтрокаСреднемесячнаяДоходность");
	
	// Получаем данные для вывода.
	ДеталиРасчета = Документы.РегистрацияФинансовыхПоказателей.РассчитатьФинансовыеПоказателиСтандартнойСтратегии(Организация, СубъектАналитики, Дата, Истина);
	
	// Вывод шапки.
	Шапка.Параметры.Заполнить(ДеталиРасчета);
	ТабличныйДокумент.Вывести(Шапка);
	
	// Вывод таблицы операций.
	Если ДеталиРасчета.Операции.Количество() > 0 Тогда
		
		ТабличныйДокумент.НачатьГруппуСтрок();
		
		Для Каждого Операция Из ДеталиРасчета.Операции Цикл
			
			Строка.Параметры.Заполнить(Операция);
			ТабличныйДокумент.Вывести(Строка);
			
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		
	КонецЕсли;
	
	// Вывод шапки расшифровки стоимости портфеля.
	ТабличныйДокумент.Вывести(ШапкаСтоимостьПортфеля);
	
	// Вывод таблицы операций.
	Если ДеталиРасчета.РасшифровкаСтоимостиПортфеля.Количество() > 0 Тогда
		
		ТабличныйДокумент.НачатьГруппуСтрок();
		
		Для Каждого ЗаписьРасшифровки Из ДеталиРасчета.РасшифровкаСтоимостиПортфеля Цикл
			
			СтрокаСтоимостьПортфеля.Параметры.Заполнить(ЗаписьРасшифровки);
			ТабличныйДокумент.Вывести(СтрокаСтоимостьПортфеля);
			
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		
	КонецЕсли;
	
	// Среднемесячная доходность
	
	ТабличныйДокумент.Вывести(ШапкаСреднемесячнаяДоходность);
	
	ТабличныйДокумент.НачатьГруппуСтрок();
	
	Для Каждого ЭлементРасшифровки Из ДеталиРасчета.РасшифровкаСреднемесячнойДоходности Цикл		
		СтрокаСреднемесячнаяДоходность.Параметры.Заполнить(ЭлементРасшифровки);
		ТабличныйДокумент.Вывести(СтрокаСреднемесячнаяДоходность);
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
	
	// Включаем только просмотр для доступности расшифровки.
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	// Отключаем сетку.
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста 
Функция ОтобразитьРасчетКатегорииПрофессиональногоУчастникаРынкаЦенныхБумагНаСервере(Организация, ДатаРасчета)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация", Организация);
	ПараметрыРасчета.Вставить("ДатаРасчета", ДатаРасчета);

	ГодовыеПоказателиДеятельности = Новый Соответствие;
	
	Результат = РаботаСОтчетностьюЦБ.ОКУД0420401_РассчитатьКатегориюПрофУчастникаНаОснованииКвартальныхПоказателей(ПараметрыРасчета, Ложь);
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Получаем макет и области таб. документа.
	Макет = Документы.РегистрацияФинансовыхПоказателей.ПолучитьМакет("РасшифровкаКатегорииПрофУчастника");
	
	ОбластьШапка				= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаВидПоказателя	= Макет.ПолучитьОбласть("СтрокаВидПоказателя");
	ОбластьРассчитанныеЗначения	= Макет.ПолучитьОбласть("РассчитанныеЗначения");
	ОбластьШапкаПериода			= Макет.ПолучитьОбласть("ШапкаПериода");
	ОбластьСтрокаПериода		= Макет.ПолучитьОбласть("СтрокаПериода");
	ОбластьЗаключение			= Макет.ПолучитьОбласть("Заключение");
	
	ОбластьШапка.Параметры.Заполнить(Результат.РеквизитыОрганизации);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ВидыПоказателей = Результат.ВидыПоказателей.Скопировать(,"НомерСтроки,ВидПоказателя,ПредставлениеМалый,ПредставлениеСредний,ПредставлениеКрупный");
	ВидыПоказателей.Свернуть("НомерСтроки,ВидПоказателя,ПредставлениеМалый,ПредставлениеСредний,ПредставлениеКрупный");
	
	Для Каждого СтрокаВидыПоказателей Из ВидыПоказателей Цикл
		ОбластьСтрокаВидПоказателя.Параметры.Заполнить(СтрокаВидыПоказателей);
		ТабличныйДокумент.Вывести(ОбластьСтрокаВидПоказателя);
	КонецЦикла;	
	
	ТабличныйДокумент.Вывести(ОбластьРассчитанныеЗначения);
	
	Квартал = Неопределено;
	Для Каждого СтрокаРасшифровки Из Результат.Расшифровка Цикл
		Если Квартал <> СтрокаРасшифровки.Дата Тогда
			Квартал = СтрокаРасшифровки.Дата;
			ОбластьШапкаПериода.Параметры.Период = ПредставлениеПериода(НачалоКвартала(Квартал), КонецКвартала(Квартал));
			ТабличныйДокумент.Вывести(ОбластьШапкаПериода);
		КонецЕсли;	
		
		ОбластьСтрокаПериода.Параметры.Заполнить(СтрокаРасшифровки);
		
		Если СтрокаРасшифровки.ВидПоказателя = Справочники.ВидыФинансовыхПоказателей.СтоимостьИнвестиционныхПортфелейКлиентовПоДоверительномуУправлениюПоСостояниюНаПоследнийКалендарныйДеньКвартала Тогда
			ОбластьСтрокаПериода.Параметры.ЗначениеПоказателя = Формат(СтрокаРасшифровки.ЗначениеПоказателя, "ЧДЦ=0; ЧС=3") + " Тыс. руб.";
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаПериода);
		
	КонецЦикла;	
	
	ОбластьЗаключение.Параметры.Заполнить(Результат);
	ТабличныйДокумент.Вывести(ОбластьЗаключение);
	
	// Включаем только просмотр для доступности расшифровки.
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	// Отключаем сетку.
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста 
Функция ОтобразитьРасчетДоходностиСтратегииСНачалаГода(Организация, СубъектАналитики, Дата);
	
	Отказ = Ложь;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ДеталиРасчета = Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьСтратегииСНачалаГода(Организация, СубъектАналитики, Дата, Истина, Отказ);
		
	МакетРасшифровка = Документы.РегистрацияСтоимостиАктивов.ПолучитьМакет("РасшифровкаДоходностиСтратегииСНачалаГода");
	
	Документы.РегистрацияСтоимостиАктивов.РасшифровкаСтрокФинПоказателей(ТабличныйДокумент, МакетРасшифровка, ДеталиРасчета.Расшифровка, "");
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТипЗначенияФинансовогоПоказателя() 
	
	ТекущиеДанные = Элементы.ФинансовыеПоказатели.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьТипЗначенияФинансовогоПоказателяНаСервере(ТекущиеДанные.ВидПоказателя);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипЗначенияФинансовогоПоказателяНаСервере(ВидПоказателя) 
	
	Если ВидПоказателя = Справочники.ВидыФинансовыхПоказателей.КатегорияПрофессиональногоУчастникаРынкаЦенныхБумаг Тогда
		Элементы.ФинансовыеПоказателиЗначение.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг");
		
	ИначеЕсли ВидПоказателя = Справочники.ВидыФинансовыхПоказателей.КоличествоКлиентовПоДоговорамДоверительногоУправленияПоСостояниюНаПоследнийКалендарныйДеньКвартала Тогда
		Элементы.ФинансовыеПоказателиЗначение.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 0, ДопустимыйЗнак.Неотрицательный));
		
	Иначе
		Элементы.ФинансовыеПоказателиЗначение.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 2));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыеПоказателиВидПоказателяПриИзменении(Элемент)
	
	УстановитьТипЗначенияФинансовогоПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыеПоказателиПередНачаломИзменения(Элемент, Отказ)
	
	УстановитьТипЗначенияФинансовогоПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПоказателейПриИзменении(Элемент)

	Если Объект.ФинансовыеПоказатели.Количество() Тогда
		
		Если Вопрос("Табличная часть финансовые показатели будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			ЭтаФорма.ГруппаПоказателей = ПолучитьГруппуПоказателей(Объект.СубъектАналитики);
			Возврат;
		КонецЕсли;
		
		Объект.ФинансовыеПоказатели.Очистить();
		
	КонецЕсли;	
	
	ЗаполнитьГруппыВидовФинансовыхПоказателей(ГруппыВидовФинансовыхПоказателей, ЭтаФорма.ГруппаПоказателей = "Организации");
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры
